{
    "zodiacCharacterList": [{
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Like their ruling planet Mars, Aries are hot and stormy. They're a combination of confidence and passion combined with temper and petulance. Everyone who ever loves an Aries tries-unsuccessfully but excitingly-to tame them.\n\nThis wildly flirtatious fire sign certainly takes the initiative when it comes to romance. They're quick to move when someone catches their eye. But to keep an Aries' attention, that someone needs to be as energetic and as exciting as they are. This passionate sign loves adventure. So don't mistake an Aries' restlessness for boredom. It's not a signal that they'd prefer to be somewhere else (or with someone else). It's a signal they want to pick up the pace!\n\nWhirlwind romances are common for the Aries personality. But once love sets in, it's generally for life. As long as there's plenty of spice and excitement to keep the blood pumping, the relationship will be strong and long lasting."
                                              }, {
                                              "title": "Career & Money",
                                              "content": " 1.Aries' Career Mantra: \"I've got this.\"\n\nAries'greatest career strength: Leadership. Everyone naturally looks to Aries, and being responsible for others comes naturally.\nAries's greatest career challenge: Delegating. Learning how to trust the team is key for Aries.\n\n2.Even though an Aries is wise to save for a rainy day, this isn't likely the case. Because Rams prize excitement, shopping, gambling, and playing the market are far more appealing to them. They aren't too focused on their financial future. In fact, living for the moment is the true Aries philosophy. Money is rarely scarce because they love working, but it can be spent almost as quickly as it comes in. The one thing you can be absolutely sure of is that Aries will have as much fun making as much money as they possibly can!"
                                              }, {
                                              "title": " Health",
                                              "content": "Ailments\nHeadaches\n\nAries'Strengths: Energy\nAries'Weaknesses: Green juice, trendy diets, and too-good-to-be-true miracle cures. Even though Rams know that there's no quick fix, they can't resist any product that claims to give them an edge over other people.\n\nThe Best Fitness Routines\nAries are all about living it up every single moment and rarely have a shortage of energy.\nAries can frequently be found at the gym, which they truly think of as a happy space. Generally healthy, Aries know how to indulge when the time is right but can feel lethargic and blah if they abstain from physical activity for too long."
                                              }, {
                                              "title": "Parent",
                                              "content": "Parent & Child\nThe Best Toys for an Aries Child\nBlocks, bikes, and balls. On the go and independent, Aries kids love activities they can do themselves and physical toys that let them work up a sweat.\n\nThe Best Activities\n Known for their physical prowess, Aries kids also love the challenge of an intellectual activity. If they've already spent hours on the playground (an Aries favorite) pull out the puzzles. They'll enjoy the intellectual challenge of getting them done."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Ram\nElement:   Fire\nPolarity:   Positive\nQuality:   Cardinal\nRuling Planet:   Mars\nRuling House:   First\nSpirit Color:   Red\nLucky Gem:   Diamond\nFlower:   Thistle & honeysuckle\nTop Love Matches:   Sagittarius\nKey Traits:   Thistle & honeysuckle\n\n"
                                              }, {
                                              "title": "Personality",
                                              "content": " The first sign of the Zodiac, Aries are the trailblazers. Passionate and independent, Aries will never do something just because everyone else is doing it-a Ram needs to be 100 percent committed to the task at hand. Competitive to the max, the best way to motivate an Aries is to turn something into a contest. Aries will put everything they have (and then some) into winning. Loyal, smart, and impulsive, they always have multiple projects on their mind, and won't be satisfied until their work, social life, and personal lives line up exactly with the dream life they've envisioned. Those who are drawn to magnetic Aries may have trouble keeping up-but if they can, they'll have a friend for life."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Gifts\nWhether it's backpacking around the world, launching a business, or training for a marathon, once an Aries sets a goal, they will achieve it. They don't care what anyone else thinks, and can tune into their intuition and dreams in a heartbeat. Rams never need a plus one-they love their own company, and consider going solo to the movies a rare treat.\n\nChallenges\nThe world according to an Aries makes so much sense that they have a hard time listening to, much less accepting, alternative viewpoints. Slowing down is also tough. A Ram's mind goes a million miles a minute, and slowing down for others can be excruciating. But when it comes to maintaining relationships, Aries must learn to adapt and embrace other ways of doing, being, and seeing.\n\nSecret weapon\nStrong, adamant, and forged in fire, it's fitting that Aries'secret weapon is iron, one of the strongest elements. Weld, cast, machine, forge, temper, harden, or anneal it, iron can take on a seemingly limitless range of shapes and qualities. For an Aries, an iron-rich diet can boost confidence and performance."
                                              }, {
                                              "title": "Friends",
                                              "content": " \"Activity \" is the key word for this sign. When it comes to Aries' friends, the more variety, the better. Easy to meet and get along with, an Aries makes an incredible amount of connections in a lifetime. Long-term friends are trickier. Only those who are equally energetic and able to keep up are apt to stay connected with an Aries for the long haul. Aries are inspired by action and get bored by too many coffee dates. Think: long hikes, pottery classes, or hitting up an old-school arcade-anything new, offbeat, quirky, or action-packed."
                                              }]
                            },
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Ruled by Venus, Taureans are sensual to the max and very connected to their physical bodies. A Taurus must feel physical attraction from the start if a romance is going to take off. But those who want to seduce Taurus first have to get past the formidable external barriers this sign places in front of them. Bulls won't let anyone see their inner life, and they may seem a little formal and standoffish until you prove your true worth.\n\nRather than flirting, Taurus prefers a real conversation to trading pleasantries or jokes. And forget about trying to figure out what Taurus wants you to say. This sign senses when you're not being genuine, and nothing is more of a turn-off.\n\nBut even though Taurus may seem placid when you meet in a social setting, all bets are off behind closed doors. Sensual Taurus connects best via physical sensations, and is all about pushing boundaries when they're with someone they trust."
                                              }, {
                                              "title": "Career & Money",
                                              "content": "Taurus' Career Mantra: \"One step at a time.\"\n\nTaurus greatest career strength: Persistence. A Taurus will look at a project, break it down into steps, and get things done, even if it means burning the midnight oil. Taurus never utters the words \"too busy \" and quickly becomes a cherished member of any work team.\n\nTaurus greatest career challenge: Respecting authority. A Taurus will go the extra mile-if they believe in the project. But if they don't like a project or a manager, they'll dig in their heels and get things done, but with some side-eye and shrugged shoulders. Bulls need to learn that, even if the project isn't managed the way they think it should be, following a boss's orders is all part of the process."
                                              }, {
                                              "title": " Health",
                                              "content": "Ailments\nSore throats\n\nTaurus' Strengths: Determination\nTaurus' Weaknesses: Belief that taking medicine is giving up and seeing a doctor is a sign of failure. Stubborn Bulls sometimes have a hard time accepting medical advice and may try DIY cures or just ignoring the problem away.\n\nThe Best Fitness Routines\nTaurus thrives on routine and loves going to the same classes, where they have their spot, their instructor, and a sense of exactly how the class will unfold. Taurus also thrives on a challenge and loves evidence they're getting better.\nSigning up for a race and using a fitness tracker are great ways to keep a Taurus moving. The Bull always feels good after a sweat session, but getting them motivated can be tough, so easy strategies to get moving are always welcome."
                                              }, {
                                              "title": "Parent",
                                              "content": "Parent & Child\nThe Best Toys for a Taurus Child\nPuzzles, electronics, and books. Taurus kids love to figure out the world, and tech toys are great for helping them suss out how things work. Books can tap into a baby Bull's emotions, giving them words and concepts for feelings that may be hard to describe.\n\nThe Best Activites\nFriendly and easygoing, Taurus kids love get-togethers with others, whether it's on the playground or a playdate at someone's house. Taurus kids also love art from an early age, and a museum visit is fun because Taureans are drawn to the vibrant colors and artwork."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   Bull\nElement:   Earth\nPolarity:   Negative\nQuality:   Fixed\nRuling Planet:   Venus\nRuling House:   Second\nSpirit Color:   Pink\nLucky Gem:   Emerald\nFlower:   Rose, Poppy, & Foxglove\nTop Love Matches:   Cancer & Virgo\nKey Traits:   Rose, Poppy, & Foxglove\n\n"
                                              }, {
                                              "title": "Personality",
                                              "content": "Smart, ambitious, and trustworthy, Taurus is the anchor of the Zodiac. Amazing friends, colleagues, and partners, Taureans value honesty above all else and are proud that their personal relationships tend to be drama free. Bulls get the reputation of being stubborn, but they're not always stuck in their ways. This searching sign is willing to see another point of view, but they won't flip-flop on an opinion just to make someone else happy. They will shift their thinking only if they truly have a change of heart."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Strenghs\nCompassion, emotional sensitivity, fierce protection of loved ones, tenacity.\n\nWeaknesses\nManipulative, indirect conflict, clinging to the past, insecure, packrat.\n\nLikes\nRelaxing near or in water, art, home-based hobbies, a good meal with friends, helping loved ones.\n\nDislikes\nStrangers, revealing of personal life, any criticism of Mom.\n\nCharismatic marks\nMedium build, round face, prominent breasts, a tendency to take charge.\n\nBest environment\nCancer will always be most comfortable at home, close to family, familiar things, and dear"
                                              }, {
                                              "title": "Friends",
                                              "content": "\"Friends forever \"is a cliche probably dreamed up by a Taurus. When it comes to friendship, once you're in with a Bull, you're in for life. Bulls aren't just loyal, they're also fun, with a witty streak that always keeps you laughing. They don't take friendship lightly, and remember birthdays, anniversaries, and other key events, often with a card or gifts. But it can be tough to get into a Taurus' inner circle. For one, they can be suspicious of outsiders, and may assume that someone has an agenda. Be honest with Taurus-they hate lies (even \"you look amazing \"white lies) and are suspicious of people who flatter them too much.Be real - disagreeing(respectfully!) with a Taurus and prompting a debate can go a long way toward becoming BFFs."
                                              }]
                            },
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Dynamic, intense, and with so many shifting parts to their personalities, Gemini love to date. Indeed, they consider dating a skill. Gemini are great at drawing first dates out of their shells, and they rarely have a \"bad \"date-because this optimism-infused sign will always finds something positive about the person they meet or the conversation they shared.\n\nBut even though dating is fun, it can be hard for Gemini to take the next step. While the Twins love the idea of love, they're also passionate about their own independence, and they want to make sure that they aren't giving anything up before taking the next step. And while Gemini aren't dishonest, their ruling planet Mercury makes them especially adept at telling others what they want to hear-which some might perceive as leading people on.\n\nGemini aren't bound by convention. If they find themselves partnering with someone isn't the 'type'that their friends or family would have expected,well,Gemini just don't care. Once in love, Gemini aren't afraid to make their own rules(with their partner of course) about what the relationship looks like."
                                              }, {
                                              "title": "Career & Money",
                                              "content": "Gemini's Career Mantra: \"I make my own reality.\"\n\nGemini's greatest career strength: Communication. Inspired by Mercury the messenger, Gemini is an amazing communicator who knows innately how to present ideas for approval. Whether it's standing in front of a meeting, delivering a killer deck, or writing an amazing article, Gemini is a master wordsmith who can either find success in an individualized field (such as writing) or as part of a larger team.\n\nGemini's greatest career challenge: Finishing things. Gemini love the rush of starting a project, but those detail-oriented \"gotta be done \" tasks in the middle? Not so much. Gemini prefer to do what they excel at, and they might slow down or sink into frustration if a task or assignment includes steps that aren't in their wheelhouse. Learning how to organize their schedule, work on a deadline, and pay attention to detail will give the Twins a must-have skill set for anyone who wants to hire them."
                                              }, {
                                              "title": " Health",
                                              "content": "Ailments\nSore throats\n\nGemini's Strengths:Optimism\nGemini's Weaknesses: Gemini put their hands over their ears and pretends that things aren't happening. While dissociating can be a helpful skill, being fully present in one's own body (and at the doctor's office) is an essential skill for Gemini to maintain their best health.\n\nThe Best Fitness Routines\nGemini love goals and to-do lists, but they also get bored from too much repetition. CrossFit, PiYo, or a fitness streaming class are ideal, because the Twins get to try new things, can see themselves get stronger, and aren't doing the same old workout.\nGemini also love working out in groups. While their primary competitor is Gemini, they love the socialization and motivation that comes from being part of a team. They truly don't care if they win or lose, as long as they're having a good time, and they may be just as happy to support a team from the sidelines, with a few leisurely laps around the field to count as a workout."
                                              }, {
                                              "title": "Parent",
                                              "content": " Parent & Child\nThe Best Toys for a Gemini Child\nBlocks, dolls, and stuffed animals. Social Gemini make animal and doll \"friends \" easily and can engage in imaginative play for hours. Give them plenty of toys that enable them to build their own worlds, including blocks to create homes for the cuddly families they've created.\n\nThe Best Activities\nEnergetic and up for anything, a Gemini kid gravitates toward other kids. They love taking classes where they can socialize with others. They also love actively engaging with Mom and Dad, and they're psyched when a favorite grown-up joins them on the slide instead of watching from the sidelines."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   Twins\nElement:   Earth\nPolarity:   Positive\nQuality:   Mutable\nRuling Planet:   Mercury\nRuling House:   Third\nSpirit Color:   Yellow\nLucky Gem:   Tiger's Eye & Emerald\nFlower:   Lavender & Lily of the Valley\nTop Love Matches:   Aries & Leo\nKey Traits:   Lavender & Lily of the Valley\n\n"
                                              }, {
                                              "title": "Personality",
                                              "content": "Smart, passionate, and dynamic, Gemini is characterized by the Twins, Castor and Pollux, and is known for having two different sides they can display to the world. Expert communicators, Gemini is the chameleon of the Zodiac, adept at blending into different groups based on the vibe and energy they perceive. While they're also amazing at showcasing surface traits, the Gemini well runs deep, which is why the Twins are one of the Zodiac's most emotionally intelligent signs.\n\nEnergetic and quick-witted, Gemini never gets stuck in the past and doesn't ruminate on what might have been. Instead, they move forward with glass-half-full optimism and an ability to always look on the bright side-and land on their feet-in nearly any situation. With a mind that's constantly racing, even when they're just quietly hanging out, the Twins never get bored. In fact, Gemini are happy keeping their own company, and can often turn their solitary daydreams into reality. "
                                              }, {
                                              "title": "Aspects",
                                              "content": "Gifts\nEquipped with almost uncanny emotional intelligence, Gemini can easily read a room and know exactly what other people want to hear from them. They can easily shift their personality depending on mood, going from Friday night life of the party to Monday morning office superstar. Energetic and passionate, Gemini can breathe new life into a same-old routine and excite other people simply by their all-inpresence.\n\nChallenges\nThat social chameleon rep can sometimes earn Gemini a reputation as two - faced.While a Gemini is all about truth,sometimes a Gemini is more likely to talk to others about a conflict instead of approaching the person who's actually causing it. The Twins have also been known to stir up gossip just to keep things exciting.\n\nSecret weapon\nIntelligence. Gemini is quick-witted and can read a room or situation in an almost supernatural way. Without saying very many words, a Gemini soon knows who has an agenda, who's a good ally,and who may need someone to bolster them up.Because of this,Gemini is an amazing friend,leader,and person everyone should be lucky to have in their lives."
                                              }, {
                                              "title": "Friends",
                                              "content": "The bad news: Gemini will forget your birthday or flake on a date that you set in the calendar months ago.\n\nThe good news: It's not personal, and your Gemini friend will make it up to you. Funny, witty, and talking a mile a minute, a Gemini will keep you laughing, and it's likely that some of your best memories involve a Gemini. The Twins can infuse drama and intrigue into even the most same-old-sounding coffee date, and they may surprise you by ordering your lattes in a foreign accent or requesting some custom-made concoction dreamed up in their head.\n\n Even though Gemini have tons of friends and their calendar gets packed months out, when they're with you, you're the only person that matters. But even though you may think your Gemini friend knows you well, it may take longer for you to get to know them. Gemini love connecting to people, yet they can guard their own selves and personalities from others. "
                                              }]
                            },
                            
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "\"I feel \" is the key phrase for Cancer, and this is all too evident when it comes to love. Tender and gentle, Cancerians will show sensitivity with their lovers without a second thought. They love readily and choose a mate who can understand them as much as possible.\n\nSuperficial or overly ambitious partners are not well-suited. The Cancer lover will look for someone who is equally intuitive. They are devoted partners, love children, and marry for life."
                                              }, {
                                              "title": "Career & Money",
                                              "content": "Cancerians can be as tenacious as they are sensitive. When there's a job to do, they roll up their sleeves and get to it. They especially shine when performing caregiving or related tasks, and they make excellent nurses. Other career ambitions include housekeeper, gardener, and journalist. Cancerians' love of country gives them the base to being outstanding politicians. The need to feel as though they are making a difference, however small, is essential for this sign to feel fulfilled.\n\nSecurity is of utmost importance to the Cancer native, and money is no different. Making money generally comes easily, and putting it away is usually what happens. Cancerians are not overspenders; in fact, they are far more apt to invest a few dollars and make their money grow. Many Cancer personalities see money as a symbol of their status in life and are inspired to build healthy bank accounts as a result. Cancers are resourceful and manage their time and money well. "
                                              }, {
                                              "title": " Health",
                                              "content": " Ailments\nFortitude\n\nCancer's Weaknesses: When things don't feel right in Cancers' life, they can feel it in their gut-literally. When Crabs feel that they can't express their emotions, or that it's not safe to do so, they develop stomach pains, digestive ailments, and other GI troubles.\n\nThe Best Fitness Routines\nMore than any other sign, Cancer intuitively feels the mind-body connection and sees fitness as essential to calming the mind and finding space in the day for tuning into his or her body.\nCancer sees fitness as an almost spiritual practice-a time to commune uninterrupted with mind and body-and tends to shy away from group fitness classes where an instructor can interfere with the flow. Cancer has a reserve of self-discipline, doesn't have any problem DIY-ing a routine, and may find yoga, running, or Pilates to be great ways to simultaneously move and meditate."
                                              }, {
                                              "title": "Parent",
                                              "content": " Parent & Child\nThe Best Toys for a Cancer Child\nDolls, stuffed animals, and action figures. With a rich imagination, Cancer children see \"best friends \" in their toy chest, and they might carry around a stuffed animal lovey for years. If a Cancer child loves something, parents should consider buying backups-Cancer children have intense emotional attachments to objects and will be crushed if a lovey goes missing.\n\nThe Best Activities\n Imaginative and creative, Cancer kids have a rich internal life. They may be content watching from the sidelines on the playground, but don't assume that they aren't \"playing.\" Little Crabs may be telling themselves a fanciful story about what they're observing. That said, Cancer children can be shy and may need Mom and Dad to help them make friends on the playground. Even introducing your little Cancer to other kids can be a big first step."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Crab\nElement:   Water\nGroup:   Emotional\nPolarity: Negative\nPlanet: Moon\nCross Quality: Cardinal\nHouse Ruled: Fourth\nColor: White,silver\nLucky Gem: Pearls\nOpposite Sign: Capricorn\nChinese Analog: Goat\n\n"
                                              }, {
                                              "title": "Personality",
                                              "content": "Deeply intuitive and sentimental, Cancer can be one of the most challenging Zodiac signs to get to know. Emotion runs strong for this sign, and when it comes to family and home, nothing is more important. Sympathetic and empathetic, Cancerians are greatly attuned to those around them. Devotion is the keyword for this sign, making them wonderfully sensitive people to be around."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Strengths\nCompassion, emotional sensitivity, fierce protection of loved ones, tenacity.\n\nWeaknesses\nManipulative, indirect conflict, clinging to the past, insecure, packrat.\n\nLikes\nRelaxing near or in water, art, home-based hobbies, a good meal with friends, helping loved ones.\n\nDislikes\nStrangers, revealing of personal life, any criticism of Mom.\n\nCharismatic marks\nMedium build, round face, prominent breasts, a tendency to take charge.\n\nBest environment\nCancer will always be most comfortable at home, close to family, familiar things, and dear friends."
                                              }, {
                                              "title": "Friends",
                                              "content": "Traditional and maternal, Cancerians make excellent parents. In fact, all aspects of family are number one to this sign. This can be seen in the homes they make and in the dedication to duty they display. Cancer natives are often willing to overlook personality conflicts when it comes to family simply because they are related. Whatever needs to be done, you can count on a Cancer native to go the distance for a family member. They are deeply sentimental and are diligent about keeping family albums and histories intact. Passing on stories to the next generation is a favorite pastime.\n\nWhen it comes to friendships, the Cancer person is very helpful. They're almost always willing to lend a hand, providing it doesn't conflict with family obligations. Friends are held in high regard and are generally of like mind. Because the Cancerian generally prefers the home scene rather than going out, folks who enjoy visiting and sharing activities such as cards or at-home dining are top picks for buddies. Although their deeply intuitive, heart-not-head personality makes Cancerians very sympathetic, it can also make them a little hard to understand. Time is the cure for this!"
                                              }]
                            },
                            
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Passionate, intense, and fiery, Leo loves hard. For Leos, love itself-whether falling in love, thinking about love, making love-is one of their favorite things in the world. A busy Lion will always make sure that there's plenty of time for passion in his or her life.\n\nFalling in love is easy for Lions. But finding a person who can match them and staying in love can be tough. Leo loves flirting and dating, and has no problem penciling new names onto the calendar. This sign loves the rollercoaster that is romance, from butterflies before the first date to catching their breath after the first time in bed. But while Lions thrive on the novelty of dating, they can be easily disappointed if their date fails to live up to their outsize expectations. That's why Leos occasionally finds true love with partners they may have dated or broken up with in the past."
                                              }, {
                                              "title": "Career & Money",
                                              "content": "Leo's Career Mantra: \"Just watch me.\"\n\nLeo's greatest career strength: Passion. Leos bring fiery intensity to everything they do, including work, and when they believe in what they're doing, there's no stopping them.\n\nLeo's greatest career challenge: Teamwork. Lions like to do things themselves, and they have a certain way of getting things done. Letting others take the reins can be tough.\nLeos work hard for the money, and they want you to know it. Leo loves luxury, whether it's five-star hotels or designer labels, and isn't shy about splashing out cash for quality. But Leo isn't foolish. Although this sign appreciates spending money, they know how to think long-term, and there's a strategy behind their spending decisions. Leo's motto is \"You can 't take it with you,\" and Lions will crunch the numbers to live in the best style they can afford-without going into debt."
                                              }, {
                                              "title": " Health",
                                              "content": "Ailments\n\nFortitude\n\nLeo's Weaknesses: Supplements. Leo always wants to be the best, and can't say no to a pill, diet, or drink that promises to maximize this sign's potential.\n\nThe Best Fitness Routines\nLeo loves the see-and-be-seen atmosphere of a trendy cycling class or barre class, and also finds new workout clothes to be the best kind of reward for keeping and staying motivated.\nLeo thrives on competition and gets lonely working out all alone. Having a running buddy, belonging to a Facebook fitness group, or working with a personal trainer will help Lions keep their fitness goals on point."
                                              }, {
                                              "title": "Parent",
                                              "content": "Parent & Child\nThe Best Toys for a Leo Child\nStuffed animals. Tiny Leo loves reigning over a crowd of loveys, and loves imaginative play, where he or she controls all the details and decides what happens next.\n\nThe Best Activities\nDramatic Leo excels in acting classes. Enrolling young Leos in a Parent & Me movement class can help them get in touch with their bodies, and they'll love using their bodies as an instrument to tell stories."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Lion\nElement:   Fire\nPolarity:   Positive\nQuality: Fixed\nRuling Planet: Sun\nRuling House: Fifth\nSpirit Color: Gold\nLucky Gem: Carnelian\nFlower: Sunflower & marigold\nTop Love Matches: Libra\nKey Traits: Sunflower & marigold\n\n "
                                              }, {
                                              "title": "Personality",
                                              "content": "Bold, intelligent, warm, and courageous, fire sign Leo is a natural leader of the Zodiac, ready to blaze a trail, vanquish injustice, and make a name for themselves along the way. Blessed with high self-esteem, Lions know that they possess enviable traits and they are proud of them. They don't believe in false modesty and will be the first to praise themselves for a job well done. But Leo isn't self-aggrandizing or unwilling to roll up those sleeves and do the work: this sign knows that in order to be respected and admired, he or she needs to put in the effort worthy of a leader."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Gifts\nA natural leader, Leo's very presence inspires others to be the best they can be. But with great power comes great responsibility. Leos love the pull of the limelight, and they're occasionally swayed by what other people want (or expect) them to do. Although this sign has a loud inner voice, learning to listen to it-especially if it's guiding them toward an unpopular move-is a lifelong lesson that will only make proud Lions stronger and more resilient.\n\nChallenges\nLions are well known for their loud roar. But learning to quiet down and listen is essential for Leos to reach their peak power-especially when they're hearing a voice that doesn't match their confidence and certainty. And while this sign thrives on their split-second decision-making and reaction skills, they might sometimes benefit from taking a few seconds, minutes, or even days before making their opinion known on a subject. Researching all sides, doing due diligence, and learning from other people's experiences are all essential for a Leo to be as strong a leader as possible.\n\nSecret weapon\nA giving nature. Most people assume that Lions are all about themselves. But appearances are deceiving. A Leo's secret weapon is his or her boundless capacity for love, affection, and generosity."
                                              }, {
                                              "title": "Friends",
                                              "content": "\"Friends \" is one of Leo's favorite words, and Lions are known for collecting friends-but not in a transactional way. Leo genuinely adores other people, and innately gets that the more people you know, the easier life can be. Leos easily hand out their phone number, are quick to follow or DM on Instagram, and will invite you to their happy hour five minutes after meeting you. But getting to know a Leo on a deeper level can be challenging. For starters, it's tough to pin down someone with that kind of social schedule. And although Lions are friendly, they won't share their inner emotional life until they\"re really close with you.A Leo is a valuable ally in your social circle,and when he or she does reveal secrets,listen up and feel honored!"
                                              }]
                            },
                            
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Virgo loves hard, and is always in pursuit of star love-the kind where souls, minds, and bodies seamlessly merge. That's why this sign sometimes gets the (unfair) reputation of being too picky. They're not-they just know exactly what they're looking for, and know that settling for someone good enough will mean that they'll never find the love that their body and soul crave.\n\nEven when they find someone who might fulfill that role in their lives, Virgos may still be cagey. That's because this sign is innately wired to protect their hearts. During the initial courtship, which may feel like it's taking forever, Virgo is watching his or her potential partner's every move. They want to make sure that this person will live up to the ideal image that they're crafting in their mind, and a wrong move (like being rude to a waiter) will cause Virgo to cross this candidate off the list.\n\n However, once Virgos give their heart, they give everything. They expect absolute honesty and give the same in return. A Virgo truly believes that partnership means \"what's mine is yours\", and this sign elevates a partnership above all else. Because Virgos believe in lifelong love, a breakup or betrayal can be particularly devastating.\n\nVirgo may seem a bit buttoned-up in public, but they love sex-they see it as a celebration of their partnership and a commitment to their partner. They cherish the physical aspects of their relationship and are not happy if they don't have that, even for a few days. Making plenty of physical contact, including morning kisses and long evening embraces, massages, and time in the sheets, is key to keeping your Virgo happy."
                                              }, {
                                              "title": "Career & Money",
                                              "content": "Virgo's Career Mantra: \"Perfection is possible.\"\n\nVirgo's greatest career strength: Intelligence. Fiercely intelligent, Virgos are a manager's dream because they can both see the big picture and focus in on the tiny details to make a project work.\n\nVirgo's greatest career challenge: Perfectionism. Virgo wants everything he or she does to be the best, and will sometimes delay projects when \"good enough \"might have been totally acceptable.\nIntelligent and rational,Virgo has a rep for being good at saving money.And they are - most of the time.But with impulsive Mercury as their ruling planet,sometimes Virgos just want to spend.This sign absolutely enjoys working hard for hard work 's sake, but they're also fond of the comfort that a paycheck provides.And while Virgo doesn 't care what others think and never buys something to impress others, he or she tends to have expensive taste. Virgo also loves to splurge on travel and can't resist a plane ticket or luxe hotel.Ultimately,though,Virgos temper their spending with smart savings strategies,coupled with their ability to parlay that big intelligence into a big paycheck."
                                              }, {
                                              "title": " Health",
                                              "content": "Ailments\nPhysical fitness\n\nVirgo's Weaknesses: Boutique gym classes. Virgo loves the adrenaline rush of an intense class, often taking classes back to back. They also adore boutique classes with individualized instruction, which may do a number on their bank account.\n\nThe Best Fitness Routines\nPilates and barre classes allow Virgos to use their intense focus on their body, which lets them to take a break from whatever else is on their mind.\nNot only do Virgos love the long, lean look that a barre class gives them, they also love focusing on subtle improvements as well as the idea that they can always do better the next day."
                                              }, {
                                              "title": "Parent",
                                              "content": "Parent & Child\nThe Best Toys for a Virgo Child\nBlocks, magnetic tiles, and interlocking toys. Virgo loves figuring out how things work from an early age, and logic-based toys are key for awakening that lifelong interest.\n\nThe Best Activities\nIntelligent Virgos love reading books with their parents from an early age. This sign also loves kid-focused STEAM classes (science, tech, engineering, art, and math), and may impress their parents by building a computer program before their fifth birthday."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Virgin\nElement:   Earth\nPolarity:   Negative\nQuality:   Mutable\nRuling Planet:   Mercury\nRuling House:   Sixth\nSpirit Color:   Silver\nLucky Gem:   Peridot\nFlower:   Sunflower & marigold\nTop Love Matches:   Cancer\nKey Traits:   Sunflower & marigold\n\n "
                                              }, {
                                              "title": "Personality",
                                              "content": "Smart, sophisticated, and kind, Virgo gets the job done without complaining. Virgos are amazing friends, always there to lend a hand-and also lend advice. Practical Virgos are incredibly adept at big picture thinking, and planning out their life, their vacations, and what they're going to do today isn't a drag-it makes them feel in control and secure.\n\nVirgo has a rich inner life, and can sometimes seem shy at first meeting. A Virgo won't spill secrets right away, and it's important to earn a Virgo's trust. But once you do, that Virgin will be a friend for life. And if you think that you're dating a shy Virgo, trust that those walls will fall down in the bedroom. One of the most passionate signs, Virgos specialize at connecting to their physicality, and this earth sign loves and celebrates physical connection with their partner."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Gifts \nGraceful, harmonious, and obsessed with making things the very best they can be, Virgo is notorious for being type A-but that's only because this sign knows that everything good can be made great, and that everything great can be perfect. Smart and intensely curious, Virgos are passionate about uncovering the why-which is why a Virgo's friends consider him or her their own personal encyclopedia. Known for their grace, Virgos can always talk their way out of sticky situations, and everyone is charmed by their wit and ability to put others at ease.\n\nChallenges\nVirgo's desire to have everything be perfect can manifest in frustration when things don't live up to those (sometimes unrealistic) expectations. Besides occasionally leading to fights with friends and partners, Virgo's focus on perfection can cause everything-even uploading an Instagram photo-to take forever. Learning to go with the flow and accept \"good enough \"is a constant struggle.\n\nSecret weapon\nVirgo is incredibly hard working. When this sign wants something, they'll work for it. They're also good at making the most of things-friends look to them to help them with a DIY project or redecorate their home. Virgins push the people around them to be their best-if you want a training buddy for a marathon, you know who to call. Bottom line: Virgos work hard, and that work ethic inspires everyone in their life."
                                              }, {
                                              "title": "Friends",
                                              "content": "Don't be offended if Virgo turns down the first invite you extend-although Virgos are kind and friendly to everyone, they may have some walls around them, built to protect themselves and the circle of friends they already have. This sign takes friendship very seriously, and is also very good at putting themselves (and their energy reserves) first. That's why Virgos won't take on a friend that they don't think they'd be able to sustain. So while Virgo is happy to confab in the locker room before a gym class, it may be years before he or she finally says yes to that coffee after class invite."
                                              }]
                            },
                            
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Finding the right partner will be a priority in the Libran's life. For those already in a relationship, maintaining the peace and harmony takes center stage. A Libran alone is a sad thing indeed, not to mention unnatural. They need to connect with others.\n\nAs lovers they are expressive, creative, and balanced. They love to make their partners feel completely and thoroughly satisfied from conversation to lovemaking. The Libran's charm and dedication to striking the perfect balance with others makes them wonderful partners."
                                              }, {
                                              "title": "Career & Money",
                                              "content": "\"Harmony \" is the keyword for this sign. For the Libran, maintaining this is of the utmost importance. They can be excellent leaders, and will work hard to earn - and deserve - the privilege. Truth and justice always prevail for the Libran as they go about their days. Working with others or in a partnership is ideal for this social sign. Artistic and persuasive, these folks are gifted talkers who do well in any position that provides a platform for them to chat.\n\nCareers that involve justice such as police officer, lawyer, or judge are excellent choices for the Libran. They will also succeed at such occupations as diplomat, civil servant, interior decorator, composer and fashion designer. Group settings pose no challenge for the Libran - in fact, the more the merrier. Their strong sense of diplomacy serves well in almost anything they do.\n\nIf you go shopping with a Libran, best to plan some extra time! This sign can be terribly indecisive when it comes to purchasing. Balancing their money, however, is a snap for the Libran. Keeping a good balance between savings and spending money is a real talent for these folks. Their love of fashion and housewares can see them out and about in stores quite often. One of the Libran's favorite pastimes is to shop for someone special."
                                              }, {
                                              "title": " Health",
                                              "content": "Ailments\nBack pain\n\nLibra's Strengths: Visualization\nLibra's Weaknesses: Short-term fixes. From downing caffeine-laden drinks to eating a ton of sugar, Libra often seeks energy in external, unhealthy ways, only to crash hard later.\n\nThe Best Fitness Routines\nTennis, volleyball, adult soccer-Libra loves workout routines that are just as fun as they are calorie scorching. A Libra doesn't like to sweat it out solo at the gym. For this sign, the more, the merrier."
                                              }, {
                                              "title": "Parent",
                                              "content": "Parent & Child\nThe Best Toys for a Libra Child\nMusical instruments, scarves, and costumes. Dramatic, imaginative Libra loves creative, fantasy play, and can spend hours making up a new song or raiding their costume box.\n\nThe Best Activities\nTurn on the radio and dance, dance, dance. Libra loves rhythm, and loves dancing especially with Mom and Dad."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Scales\nElement:   Air\nGroup:   Intellectual\nPolarity:   Positive\nPlanet:   Venus\nCross/Quality:   Cardinal\nHouse Ruled:   Seventh\nColor:   Blue\nLucky Gem:   Sapphire\nOpposite Sign:   Aries\nChinese Analog:   Dog\n\n "
                                              }, {
                                              "title": "Personality",
                                              "content": "\"I balance \" is the key phrase for this sign, and when it comes to keeping everything on an even keel, a Libran will lead the pack. Peace loving and judicial, this sign abhors being alone. Partnerships are very important for the Libran, especially those on a personal level. With their winning personalities and cooperative style, they aren't apt to be alone for long!"
                                              }, {
                                              "title": "Aspects",
                                              "content": "Strengths\nSocial, fair-minded, cooperative, diplomatic, gracious.\n\nWeaknesses\nIndecisive, will carry a grudge, avoids confrontations, self-pity.\n\nLikes\nHarmony, sharing with others, gentleness, the outdoors.\n\nDislikes\n Injustice, violence, conformity, and loudmouths.\n\nCharismatic marks\nAttractive, graceful, medium build, no sharp features.\n\nBest environment\nAny place that is beautiful where the company is harmonious. Very social and happiest doing things in the company of another."
                                              }, {
                                              "title": "Friends",
                                              "content": "Fun-loving and willing to help out, the Libran makes an excellent friend. Even though they can be late and indecisive, once they're on the scene, they're ready to go.\n\nThis flexible sign loves to spend time with friends and family, and doesn't hesitate to initiate gatherings. Sociable and suave, people are naturally drawn to the Libran. They have a way of creating an aura of harmony around them that's a real draw.\n\nWhen it comes to challenges, this balancing sign can see both perspectives in a disagreement, making them excellent problem-solvers. Companionable, they're apt to keep their friends and family busy."
                                              }]
                            },
                            
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "This is the strongest of the sexualities in the Zodiac. Incredibly passionate, the Scorpio takes intimacy seriously. Partners need to be intelligent and honest. Much of the foreplay for this sign happens long before the bedroom through conversation and observation.\n\nOnce in love, they are devoted and loyal to the death. But relationships can take some time. The Scorpio needs to build trust and respect for a potential mate slowly and thoroughly."
                                              }, {
                                              "title": "Career & Money",
                                              "content": "\"I desire \" is the key phrase for the Scorpio. They are fantastic at managing, solving, or creating. Once the Scorpio sets their sights on a goal, there's no deterring this sign. Tasks that require a scientific, penetrating approach are always best done by Scorpions as they will delve deeply into the materials they have. Their ability to focus coupled with determination makes for strong management skills. They're not ones to worry about making friends on the job scene; rather, they prefer to see the task accomplished well.\n\nPursuing such careers as scientist, doctor, investigator, navigator, detective, researcher, police officer, business manager, and psychologist all suit the mighty Scorpio. Respect is an essential aspect of working for this sign. They need to respect their coworkers while also feeling a sense of being respected by others."
                                              }, {
                                              "title": " Health",
                                              "content": "Ailments\nUTI's and other below-the-belt issues\n\nScorpio's Strengths: Passion\nScorpio's Weaknesses: Intense workout classes. Scorpio can be almost masochistic when it comes to exercise, and loves working out harder, longer, and faster than anyone else.\n\nThe Best Fitness Routines\nBoxing. Whether it's getting in the ring or just taking classes, you thrive on breaking a sweat and, bonus, can simultaneously get rid of frustrations that are plaguing you."
                                              }, {
                                              "title": "Parent",
                                              "content": "Parent & Child\n\nThe Best Toys for a Scorpio Child\nDolls and stuffed animals. Scorpio loves imagining and leading a team of plushed adventurers, and find that dolls and stuffed animals are safe \"people \"to share their emotions with.\n\nThe Best Activities\nScorpio loves a complex world of make - believe,which can sometimes get too intense,especially when other children are involved.Plenty of art projects,crayons,and blank paper sets the stage to allow Scorpio to let their copious creativity loose."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Scorpion\nElement:   Water\nGroup:   Intellectual\nPolarity:   Negative\nPlanet:   Pluto, Mars\nCross/Quality:   Fixed\nHouse Ruled:   Eight\nColor:   Darek Reds, black\nLucky Gem:   Opal\nOpposite Sign:   Taurus\nChinese Analog:   Pig\n\n "
                                              }, {
                                              "title": "Personality",
                                              "content": "Beneath a controlled, cool exterior beats the heart of the deeply intense Scorpio. Passionate, penetrating, and determined, this sign will probe until they reach the truth. The Scorpio may not speak volumes or show emotions readily, yet rest assured there's an enormous amount of activity happening beneath the surface. Excellent leaders, Scorpions are always aware. When it comes to resourcefulness, this sign comes out ahead."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Strengths\n\nPassionate, stubborn, resourceful, brave, a true friend.\n\nWeaknesses\nJealous, distrusting, secretive, violent, caustic.\n\nLikes\nTruth, facts, being right, teasing, longtime friends, a grand passion, a worthy adversary.\n\nDislikes\n Dishonesty, passive people, revealing secrets.\n\nCharismatic marks\nAn intense look in the eyes, muscular.\n\nBest environment\nDark, sensuous places, any situation that offers power or rouses strong feelings."
                                              }, {
                                              "title": "Friends",
                                              "content": "Sincerity and truth are strong components of the Scorpio's friends. It can take some time before really close bonds are formed, but once done, the Scorpio will remain dedicated and loyal. Witty and intellectual, they prefer companions who are humorous and easygoing.\n\nFull of surprises, this sign will give you the shirt off their backs if that's what you need, yet once they are crossed, there's no turning back. They feel deeply, and once hurt, it can be impossible to turn things around.\n\nCommitment to family is strong and consistent with the Scorpio. They are exceptionally helpful in managing affairs, and they are excellent advocates when needed."
                                              }]
                            },
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Sagittarians are playful and love to have fun with their lovers. Passionate, expressive, and willing to try just about anything, partners who are equally outgoing are best suited to the Sagittarius. There's a fine line between sex and love for this sign. Their love of change and variety can bring a lot of different faces to the bedroom.\n\nBut when it comes to love, that's an entirely different thing. Once taken, the Sagittarian is loyal, true-blue, and devoted. Mates for this sign need to be intellectual, sensitive, and expressive for the best results. As the key phrase for this sign is I understand, having a good sense of how their partner thinks is quite important. "
                                              }, {
                                              "title": "Career & Money",
                                              "content": "\"Visualization \" is the keyword for the Sagittarius. When this sign sees something as possible in their minds, they will go to great lengths to rally enough people to make it happen. Straightforward, they don't usually mince words about what they want, and they seem to know exactly what needs to be said in a given situation. They make excellent salespeople, and it's even better when this involves travel. When the Sagittarius gets a sense of the big picture, they'll work night and day to reach a goal.\n\nA variety of tasks and a dynamic atmosphere favor Sagittarians. Careers such as travel agent, photographer, explorer, artist, realtors, ambassador, and import/export trader all suit this free-spirited personality. "
                                              }, {
                                              "title": " Health",
                                              "content": "Health & Wellness\nThe Sagittarius-born natives are mostly strong, and especially in the early part of their lives, normally they don't have any health issues. But they are prone to over-indulgence, which can lead to problems in their liver.Their hips, thighs, stomach and feet are also susceptible.\n\nHealth & Wellness\nThey should avoid drinking too much, or having a heavy diet. If they can maintain a good lifestyle, they can avoid blood pressure problems or disorders of the liver.\n They may also experience some problems of sciatica or torn ligament in the thighs. They should drive carefully to avoid accidents."
                                              }, {
                                              "title": "Parent",
                                              "content": "Sagittarius in Marriage\nFirst things first _ Sagittarius cannot go along with someone who is not as busy and lively as they are, even if the other person is not as busy, he/she definitely needs to share some strong interest with Sagittarius. Otherwise, it will be very difficult for Sagittarius to keep inventing new things to keep the partnership alive. So, their need for change and excitement is prominent here too. But look at the positive side-at least their marriage will not stagnate as it happens with many couples in due course. All you need to do is to respond to your needs-how you do that is left to your imagination.\n\nSagittarius in Marriage\nNow we come to the other aspect of your attitude to marriage-your claustrophobia. You love your freedom and cannot stand being emotionally closed off. So in spite of your strong ties with your spouse, you will want to go out with friends of both sex, and keep relations with your workmates intact."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Archer\nElement:   Fire\nGroup:   Theoretical\nPolarity:   Positive\nPlanet:   Jupiter\nCross/Quality:   Mutable\nHouse Ruled:   Ninth\nColor:   Purple\nLucky Gem:   Topaz\nOpposite Sign:   Gemini\nChinese Analog:   Rat \n\n "
                                              }, {
                                              "title": "Personality",
                                              "content": "Inquisitive and energetic, the Sagittarius is the traveler of the Zodiac. Their philosophical, broad-minded approach to life motivates them to wander far and wide in the search for the meaning of life. Extroverted, optimistic, and enthusiastic, it can be almost impossible to keep the Sagittarius down. They love change. In fact, change is essential for this sign to feel their best. "
                                              }, {
                                              "title": "Aspects",
                                              "content": "Strengths\nGreat sense of humor, idealistic, generous.\n\nWeaknesses\nWill say anything no matter how undiplomatic, promises more than can deliver, can be impatient to the point of rudeness.\n\nLikes\nTravel, being outdoors, freedom, philosophy.\n\nDislikes\nDetails, being constrained, off-the-wall theories, clingy people.\n\nCharismatic marks\nOpen and interested. Generally tall, strong legs. Clothes for comfort, not style. Women act in a \"tomboy \" manner.\n\nBest environment\nOutside, on the move!"
                                              }, {
                                              "title": "Friends",
                                              "content": "Whether it's stimulating conversation or a hike through the mountains, you can expect this sign to be surrounded by friends. Sagittarians are a ton of fun and downright wacky at times. They love to laugh and to get everyone around them going. Sagittarians make friends from around the globe, enjoying the various takes on life and culture.\n\nThey're generous and are not ones to hold a grudge. Anyone who can sit a spell and talk about the deeper things in life will suit a Sagittarius just fine. They make friends easily and remain steadfast through the years.\n\nWhen it comes to family, the Sagittarius is dedicated and willing to do just about anything. Freedom and independence are extremely important for this outgoing sign. Providing these traits aren't infringed upon, all relationships go well."
                                              }]
                            },
                            {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": " The Capricorn is most often a serious lover preferring to take things slow and steady. You won't see this sign jumping into anything headfirst. Taking relationships one step at a time is the way of the Capricorn.\n\nWords can be few with this personality, yet action speaks volumes. The Capricorn values deeds and will go to great lengths to express their affections through them. They're great gift givers and don't bat an eye at the costs of spending a fantastic night out. Genuine and sincere, you can take what few words a Capricorn does say to the bank. "
                                              }, {
                                              "title": "Career & Money",
                                              "content": "\"Ambition \" is the key word for this sign. The key phrase for Capricorn is I use. The Capricorn possesses a real knack for finding the right tool for the job and getting down to it. Starting at the bottom of the ladder and working their way to the top doesn't scare the Capricorn off. They will go the distance once a goal is set.\n\nIn addition to setting high standards for themselves, honesty, perseverance, and a dedication to duty make the Capricorn an excellent manager. Loyalty and a willingness to work as hard as necessary are qualities that this sign values greatly within themselves and in those around them. Careers in management, finance, teaching, and real estate are excellent choices.\n\nCapricorns are resourceful and manage their time and money well. Every now and then, the urge to spend some hard-earned cash can see this sign packing some large shopping bags with fun and frivolous items out of the store. But as a rule, caution goes hand in hand with the Capricorn making practical purchases more likely than anything else. Multifunctional items are definitely favored."
                                              }, {
                                              "title": " Health",
                                              "content": "Health & Wellness\nThe Capricorn-born natives have good resistance power against major and minor ailments, so you will mostly find them in relatively good health in their old age. In fact, the older they grow, the healthier they appear.\n\nHealth & Wellness\nThey belong to the category, which produces the most wonderful elderly people. Their body, though, can be delicate, especially the knees and their bone structure. The danger they face is from colds, arthritis, kidney stones, digestive problems, and even disorders of the skin like shingles. They should keep their distance from alcohol and rich food."
                                              }, {
                                              "title": "Parent",
                                              "content": "Sagittarius in Marriage\nCapricorns of all genders and gender preferences are masters of walking the line between displaying affection and acting like they seemingly don't care.\nNo matter how confident and together they appear on the outside, Capricorns, especially as young adults, are rather insecure on the inside, and most have an inner feeling of lack and unworthiness. They're also quiet and reserved, so it's difficult for them to express what they're feeling.\n\nSagittarius in Marriage\nA handwritten note\nA thoughtful, loving comment\nTaking their mate's hand when walking\nLetting their partner sleep while they do what needs to be done around the house.Supporting and helping their mate in small caring ways."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Goat\nElement:   Earth\nGroup:   Theoretical\nPolarity:   Negative\nPlanet:   Saturn\nCross/Quality:   Cardinal\nHouse Ruled:   Tenth\nColor:   Brown\nLucky Gem:   Onyx\nOpposite Sign:   Cancer\nChinese Analog:   Ox \n\n "
                                              }, {
                                              "title": "Personality",
                                              "content": "When it comes to professionalism and traditional values, Capricorn wins hands-down. This practical sign loves to tackle life in the most conventional of ways, leaving no stone unturned. Considered the most serious-minded of the signs, the Capricorn possesses an independence that allows for considerable progress both personally and on the job."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Strengths\nResponsible, good managers, disciplined, self-control, dark sense of humor.\n\nWeaknesses\nKnow-it-all, unforgiving, condescending, expecting the worst.\n\nLikes\nFamily, tradition, quality craftsmanship, understated status, music.\n\nDislikes\nAlmost everything at some point.\n\nCharismatic marks\nMedium build, can get in shape with effort but tends to be a bit soft.\n\nBest environment\nPositive work situation, urban environments with culture and style, anyplace to be in charge."
                                              }, {
                                              "title": "Friends",
                                              "content": "Combining a strong wit and a love of humor, the Capricorn makes for terrific company for those they choose as friends. They will surround themselves with people who are honest, loyal, and like-minded when it comes to working values.\n\nThey cherish loved ones and will go any distance to help a friend or family member out. Traditional by nature, the Capricorn loves nothing more than holidays, such as Christmas, that bring people together with a variety of activities.\n\nAlthough a Capricorn isn't apt to have a large social circle, those included in this sign's life will find someone who is steadfast and true. Emotional displays are not common for a Capricorn. They would rather show how they feel through deed than express by word."
                                              }]
                            }, {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Intellectual stimulation is by far the greatest aphrodisiac for the Aquarian. There is nothing like a lively chat rich in culture and future possibilities to get this sign going. When it comes to love, people best suited are those that are not thrown off by Aquarian frankness.\n\nOpen, communicative, imaginative, and willing to risk are all qualities that blend well with this sign's perspective on life. Honesty and sincerity are essential for anyone seeking a long-term connection to this dynamic personality."
                                              }, {
                                              "title": "Career & Money",
                                              "content": "Aquarians bring enthusiasm to the work they do, especially when it involves expression. They have an exceptionally high ability to put their imaginative qualities to the task and to think outside the box. Careers that allow for concept development or demonstration can suit this sign well. \"I know \"is the key phrase for the Aquarius.High intellect combined with an Aquarius ' willingness to share their talents inspires many who work in the same environment. Being visionary types, Aquarians love to engage in careers that aim to benefit humankind in the long-run.\n\nWhen it comes to money, this sign really has a knack for keeping a healthy balance between having the things that they need and putting money away. When they are out shopping, the shiny, glittery, and extravagant will catch their attention even though their homes are generally decorated with great taste. It is not uncommon to find the Aquarius turning heads dressed in daring, brightly colored outfits. Most are well-attuned to their individual sense of style and are not afraid to show it."
                                              }, {
                                              "title": " Health",
                                              "content": "Health & Wellness\nPeople born under the Sign Aquarius usually have a weak bone structure, so even a minor fall or accident can cause a fracture. Their nervous system, heart, backbone, throat and bladder can also cause anxiety on the health front. However, their digestive system can adapt to all kinds of cuisines easily.\n\nHealth & Wellness\nAs they are prone to worrying too much, it can lead to brain disorders, which in the long run can cause brain tumour or epilepsy. Still, by and large they do tend to live to a ripe old age in good health.\n Is any aspect regarding your health bothering you? Get a fully personalised Birth Chart based Remedial Solutions for Personal Issues report, to solve issues on the health front."
                                              }, {
                                              "title": "Parent",
                                              "content": "Sagittarius in Marriage\nAn Aquarian husband or wife can be a fascinating marriage companion and a best friend in every sense of the word.\n\nSagittarius in Marriage\nThey are loyal, honorable, and capable of self-sacrifice.\nThey are accepting, astute listeners, and objective"
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Water Bearer\nElement:   Air\nGroup:   Theoretical\nPolarity:   Positive\nPlanet:   Uranus, Saturn\nCross/Quality:   Fixed\nHouse Ruled:   Eleventh\nColor:   Turquoise\nLucky Gem:   Turquoise\nOpposite Sign:   Leo\nChinese Analog:   Tiger\n\nAquarians present themselves in one of two ways. One on hand, you'll see someone who is shy, and quiet. On the other, an Aquarian can be boisterous, eccentric, and energetic. Both are deep thinkers with a love of helping others. Highly intellectual, this is a sign of fierce independence that prizes intuition tempered with logic. Both personality types have an uncanny ability to see both sides of an argument without prejudice, making them excellent problem-solvers. While very much attuned to the energies around them, Aquarians have a deep need to take time out alone and away to rejuvenate themselves. The keyword for this sign is imagination. The Aquarian can see a world of possibilities even when there appears to be none."
                                              }, {
                                              "title": "Personality",
                                              "content": "Aquarians present themselves in one of two ways. One on hand, you'll see someone who is shy, and quiet. On the other, an Aquarian can be boisterous, eccentric, and energetic. Both are deep thinkers with a love of helping others. Highly intellectual, this is a sign of fierce independence that prizes intuition tempered with logic. Both personality types have an uncanny ability to see both sides of an argument without prejudice, making them excellent problem-solvers. While very much attuned to the energies around them, Aquarians have a deep need to take time out alone and away to rejuvenate themselves. The keyword for this sign is imagination. The Aquarian can see a world of possibilities even when there appears to be none."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Strengths\nProgressive, original, humanitarian, independent.\n\nWeaknesses\nRuns from emotional expression, uncompromising, temperamental, aloof.\n\nLikes\nFun with friends, fighting for causes, helping others, intellectual conversation, a good listener.\n\nDislikes\nLimitations, being lonely, broken promises, dull or boring situations, people who disagree with them.\n\nCharismatic marks\nGood looks, beautiful eyes, angular faces, thin build.\n\nBest environment\nAny gathering of people to exchange ideas."
                                              }, {
                                              "title": "Friends",
                                              "content": "Even though Aquarians are great with groups of people, it takes a bit when it comes to making close friends. Deeply sensitive and cautious, closeness means vulnerability to an Aquarius, and this is not something to be taken lightly.\n\nAquarians' direct, no-nonsense approach in combination with their strong values can make it challenging to get to know the inner person. Yet those who are able to do so will discover a friendship that lasts through the years. An Aquarius will go the distance for a loved one to the point of self-sacrifice if necessary. They look for creativity, intellect, and honesty in their friends.\n\nWhen it comes to family, the expectations are no less. Although dedicated to a sense of duty to relatives, the Aquarius isn't one for developing close bonds unless the same qualities they expect in their friendships are there."
                                              }]
                            }, {
                            "characterList": [{
                                              "title": "Love & Sex",
                                              "content": "Deep within the Piscean beats the heart of the diehard romantic. Loving, tender, and exceptionally giving, this sign cherishes intimacy deeply. They are passionate lovers that need to feel a real connection with their mates. Quick flings and superficial interludes do not bide well for the Piscean whatsoever.\n\nIn relationships, they are fiercely loyal and doting. They love to give gifts and to make the person in their life feel like a million dollars. Nothing is too good for the Piscean's love interest!"
                                              }, {
                                              "title": "Career & Money",
                                              "content": "Deep within the Piscean beats the heart of the diehard romantic. Loving, tender, and exceptionally giving, this sign cherishes intimacy deeply. They are passionate lovers that need to feel a real connection with their mates. Quick flings and superficial interludes do not bide well for the Piscean whatsoever.\n\nIn relationships, they are fiercely loyal and doting. They love to give gifts and to make the person in their life feel like a million dollars. Nothing is too good for the Piscean's love interest!"
                                              }, {
                                              "title": " Health",
                                              "content": "Health & Wellness\nThe Pisces natives have perhaps the most delicate physical structure. Their feet, respiratory and circulation systems can cause worries. Besides, they are very sensitive people, and easily take to junk food-which can lead to weight gain-and can also lead to addictions. Even minor seasonal changes can adversely affect their health.\n\nHealth & Wellness\nPotential dangers are located in the feet, which may suffer from rheumatisms or circulatory problems. Sometimes, there is a tendency for getting too anxious as they can be totally disconnected with the world."
                                              }, {
                                              "title": "Parent",
                                              "content": "Sagittarius in Marriage\nWhen it comes to marriage, I am assuming that the you, the Piscean, have found the right one for you after a certain number of trials and errors. Congratulations! Now you need to learn the ABC's of married life. And the A is- Always maintain your identity in spite of the marriage. \nIf it's important for one to maintain his/her identity in a relationship, it's even more so when it comes to marriage.\n\nSagittarius in Marriage\nIf it's important for one to maintain his/her identity in a relationship, it's even more so when it comes to marriage. \nThere are those who say that after the marriage, there is no place for \"I \" the two It's turn into a \"WE \". But they are not you; you are you and you know that it is very easy for you to mould into your partner's personality and become his/her mouthpiece. You can forget your own likes and dislikes to please your partner; and as much as you may seem to be doing all this out of your own free will, it is not good for your mental well-being. Suppressing your ambitions and pleasures is not good after a certain level."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Fish\nElement:   Water\nGroup:   Theoretical\nPolarity:   Negative\nPlanet:   Neptune, Jupiter\nCross/Quality:   Mutable\nHouse Ruled:   Twelfth\nColor:   Sea-Green\nLucky Gem:   Moon Stone\nOpposite Sign:   Virgo\nChinese Analog:   Rabbit\n\n"
                                              }, {
                                              "title": "Personality",
                                              "content": "\"Understanding \" is a most appropriate keyword for this gentle, affectionate sign. Easygoing and generally accepting of others around them, Pisceans are often found in the company of a variety of different personalities. Their willingness to give of themselves emotionally lends to an aura of quiet empathy. A Pisces is comforting to be around. While not likely to be the leader, this sign's presence is strong and vibrant in any cause they put their hearts into."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Strengths\nIntuitive, compassionate, artistic, gentle, wise, musical.\n\nWeaknesses\nCan be a victim or martyr, fearful, overly trusting, sad, desire to escape reality.\n\nLikes\nSpiritual themes, time alone, visual media, time to sleep, romance, music, swimming.\n\nDislikes\nKnow-it-all, the past coming back to haunt, being criticized, cruelty of any kind.\n\nCharismatic marks\nSoft, sometimes frail to medium build. Face easily shows emotion.\n\nBest environment\nOn or near water, especially the sea. The movie theater."
                                              }, {
                                              "title": "Friends",
                                              "content": "Gentle Pisceans make some of the best friends there are. In fact, they often put the needs of their friends ahead of their own. Loyal, dedicated, supportive and compassionate, no problem is too big for the Piscean to take on. Big or small, when a challenge arises for family or friend, they will be there in every capacity possible to make things better. Deeply intuitive, Pisceans can often sense when something is askew long before anything is said.\n\nPisceans are expressive by nature and don't hesitate to let those around them know how they feel. It's not surprising for a Pisces to write a song for someone, or to buy a gift that is heartfelt and meaningful. They prefer others to be as open with them as they are. Communication with loved ones is considered most important."
                                              }, {
                                              "title": "Love & Sex",
                                              "content": "Like their ruling planet Mars, Aries are hot and stormy. They're a combination of confidence and passion combined with temper and petulance. Everyone who ever loves an Aries tries-unsuccessfully but excitingly-to tame them.\n\nThis wildly flirtatious fire sign certainly takes the initiative when it comes to romance. They're quick to move when someone catches their eye. But to keep an Aries' attention, that someone needs to be as energetic and as exciting as they are. This passionate sign loves adventure. So don't mistake an Aries' restlessness for boredom. It's not a signal that they'd prefer to be somewhere else (or with someone else). It's a signal they want to pick up the pace!\n\nWhirlwind romances are common for the Aries personality. But once love sets in, it's generally for life. As long as there's plenty of spice and excitement to keep the blood pumping, the relationship will be strong and long lasting."
                                              }, {
                                              "title": "Career & Money",
                                              "content": " 1.Aries' Career Mantra: \"I 've got this.\"\n\nAries'greatest career strength: Leadership.Everyone naturally looks to Aries,and being responsible for others comes naturally.\nAries 's greatest career challenge: Delegating. Learning how to trust the team is key for Aries.\n\n2.Even though an Aries is wise to save for a rainy day, this isn't likely the case .Because Rams prize excitement,shopping,gambling,and playing the market are far more appealing to them.They aren 't too focused on their financial future. In fact, living for the moment is the true Aries philosophy. Money is rarely scarce because they love working, but it can be spent almost as quickly as it comes in. The one thing you can be absolutely sure of is that Aries will have as much fun making as much money as they possibly can!"
                                              }, {
                                              "title": " Health",
                                              "content": "Ailments\nHeadaches\n\nAries'Strengths: Energy\nAries'Weaknesses: Green juice, trendy diets, and too-good-to-be-true miracle cures. Even though Rams know that there's no quick fix, they can't resist any product that claims to give them an edge over other people.\n\nThe Best Fitness Routines\nAries are all about living it up every single moment and rarely have a shortage of energy.\nAries can frequently be found at the gym, which they truly think of as a happy space. Generally healthy, Aries know how to indulge when the time is right but can feel lethargic and blah if they abstain from physical activity for too long."
                                              }, {
                                              "title": "Parent",
                                              "content": "Parent & Child\nThe Best Toys for an Aries Child\nBlocks, bikes, and balls. On the go and independent, Aries kids love activities they can do themselves and physical toys that let them work up a sweat.\n\nThe Best Activities\n Known for their physical prowess, Aries kids also love the challenge of an intellectual activity. If they've already spent hours on the playground (an Aries favorite) pull out the puzzles. They'll enjoy the intellectual challenge of getting them done."
                                              }, {
                                              "title": "Facts",
                                              "content": "Symbol:   The Ram\nElement:   Fire\nPolarity:   Positive\nQuality:   Cardinal\nRuling Planet:   Mars\nRuling House:   First\nSpirit Color:   Red\nLucky Gem:   Diamond\nFlower:   Thistle & honeysuckle\nTop Love Matches:   Sagittarius\nKey Traits:   Thistle & honeysuckle\n\n"
                                              }, {
                                              "title": "Personality",
                                              "content": " The first sign of the Zodiac, Aries are the trailblazers. Passionate and independent, Aries will never do something just because everyone else is doing it-a Ram needs to be 100 percent committed to the task at hand. Competitive to the max, the best way to motivate an Aries is to turn something into a contest. Aries will put everything they have (and then some) into winning. Loyal, smart, and impulsive, they always have multiple projects on their mind, and won't be satisfied until their work, social life, and personal lives line up exactly with the dream life they've envisioned. Those who are drawn to magnetic Aries may have trouble keeping up-but if they can, they'll have a friend for life."
                                              }, {
                                              "title": "Aspects",
                                              "content": "Gifts\nWhether it's backpacking around the world, launching a business, or training for a marathon, once an Aries sets a goal, they will achieve it. They don't care what anyone else thinks, and can tune into their intuition and dreams in a heartbeat. Rams never need a plus one-they love their own company, and consider going solo to the movies a rare treat.\n\nChallenges\nThe world according to an Aries makes so much sense that they have a hard time listening to, much less accepting, alternative viewpoints. Slowing down is also tough. A Ram's mind goes a million miles a minute, and slowing down for others can be excruciating. But when it comes to maintaining relationships, Aries must learn to adapt and embrace other ways of doing, being, and seeing.\n\nSecret weapon\nStrong, adamant, and forged in fire, it's fitting that Aries'secret weapon is iron, one of the strongest elements. Weld, cast, machine, forge, temper, harden, or anneal it, iron can take on a seemingly limitless range of shapes and qualities. For an Aries, an iron-rich diet can boost confidence and performance."
                                              }, {
                                              "title": "Friends",
                                              "content": " \"Activity\" is the key word for this sign. When it comes to Aries' friends, the more variety, the better. Easy to meet and get along with, an Aries makes an incredible amount of connections in a lifetime. Long-term friends are trickier. Only those who are equally energetic and able to keep up are apt to stay connected with an Aries for the long haul. Aries are inspired by action and get bored by too many coffee dates. Think: long hikes, pottery classes, or hitting up an old-school arcade-anything new, offbeat, quirky, or action-packed."
                                              }]
                            }
                            ]
}
